* Analyse des données criquet :noexport:
#+NAME: dowload-locust-data-set
#+begin_src R :exports none :results silent :tangle "do_sorting.R"
reposName <-"http://xtof.disque.math.cnrs.fr/data/"
dN <- paste("Locust_",1:4,".dat.gz",sep="")
sapply(1:4, function(i)
       download.file(paste(reposName,dN[i],sep=""),
                     dN[i],mode="wb")
       )
#+end_src

#+NAME: load-locust-data-set
#+begin_src R :exports none :tangle "do_sorting.R"
dN <- paste("Locust_",1:4,".dat.gz",sep="")
nb <- 20*15000
lD <- sapply(dN,
             function(n) {
                 mC <- gzfile(n,open="rb")
                 x <- readBin(mC,what="double",n=nb)
                 close(mC);x
             }
             )
colnames(lD) <- paste("site",1:4)
dim(lD)
#+end_src

#+RESULTS: load-locust-data-set
| 300000 |
|      4 |

#+BEGIN_SRC R :exports none :results silent :tangle "do_sorting.R"
source("http://xtof.perso.math.cnrs.fr/code/sorting_with_r.R")
#+END_SRC 

#+NAME: get-lD-mad
#+begin_src R :exports none :results output silent :tangle "do_sorting.R"
lD.mad <- apply(lD,2,mad)
lD <- t((t(lD)-apply(lD,2,median))/lD.mad)
lD <- ts(lD,start=0,freq=15e3)
#+end_src

#+NAME: filter-and-rectify-lD
#+begin_src R :exports none :results output silent :tangle "do_sorting.R"
lDf <- filter(lD,rep(1,5)/5)
lDf[is.na(lDf)] <- 0
lDf.mad <- apply(lDf,2,mad)
lDf <- t(t(lDf)/lDf.mad)
thrs <- c(4,4,4,4)
bellow.thrs <- t(t(lDf) < thrs)
lDfr <- lDf
lDfr[bellow.thrs] <- 0
remove(lDf)
#+end_src

#+NAME: detect-spikes
#+begin_src R :exports none :results output :tangle "do_sorting.R"
(sp0 <- peaks(apply(lDfr,1,sum),15))
#+end_src

#+RESULTS: detect-spikes
: 
: eventsPos object with indexes of 1795 events. 
:   Mean inter event interval: 166,81 sampling points, corresponding SD: 143,79 sampling points 
:   Smallest and largest inter event intervals: 16 and 1157 sampling points.

#+NAME: remove-lDfr
#+begin_src R :exports none :results silent :tangle "do_sorting.R"
remove(lDfr)
#+end_src

#+NAME: split-sp0
#+begin_src R :exports none :results output :tangle "do_sorting.R"
(sp0E <- as.eventsPos(sp0[sp0 <= dim(lD)[1]/2]))
(sp0L <- as.eventsPos(sp0[sp0 > dim(lD)[1]/2]))
#+end_src

#+RESULTS: split-sp0
: 
: eventsPos object with indexes of 908 events. 
:   Mean inter event interval: 164,88 sampling points, corresponding SD: 139,06 sampling points 
:   Smallest and largest inter event intervals: 16 and 931 sampling points.
: 
: eventsPos object with indexes of 887 events. 
:   Mean inter event interval: 168,72 sampling points, corresponding SD: 148,59 sampling points 
:   Smallest and largest inter event intervals: 16 and 1157 sampling points.

#+NAME: mkEvents-sp1
#+begin_src R :exports none :results silent :tangle "do_sorting.R"
evtsE <- mkEvents(sp0E,lD,14,30)
#+end_src

#+NAME: summary-evtsE
#+begin_src R :exports none :results output :tangle "do_sorting.R"
summary(evtsE)
#+end_src

#+RESULTS: summary-evtsE
: 
: events object deriving from data set: lD.
:  Events defined as cuts of 45 sampling points on each of the 4 recording sites.
:  The 'reference' time of each event is located at point 15 of the cut.
:  There are 908 events in the object.

#+NAME: use-mkNoise
#+begin_src R :exports none :results silent :tangle "do_sorting.R"
noiseE <- mkNoise(sp0E,lD,14,30,safetyFactor=2.5,2000)
#+end_src  

#+NAME: summary-noiseE
#+begin_src R :exports none :results output :tangle "do_sorting.R"
summary(noiseE)
#+end_src 

#+RESULTS: summary-noiseE
: 
: events object deriving from data set: lD.
:  Events defined as cuts of 45 sampling points on each of the 4 recording sites.
:  The 'reference' time of each event is located at point 15 of the cut.
:  There are 1330 events in the object.

#+NAME: goodEvtsFct-definition
#+begin_src R :exports none :results silent :tangle "do_sorting.R"
goodEvtsFct <- function(samp,thr=3) {
    samp.med <- apply(samp,1,median)
    samp.mad <- apply(samp,1,mad)
    above <- samp.med > 0
    samp.r <- apply(samp,2,function(x) {x[above] <- 0;x})
    apply(samp.r,2,function(x) all(abs(x-samp.med) < thr*samp.mad))
}
#+end_src    

#+NAME: get-good-events-in-evtsE
#+begin_src R :exports none :results silent :tangle "do_sorting.R"
goodEvts <- goodEvtsFct(evtsE,8)
#+end_src

#+NAME: pca-of-evtsE-good
#+begin_src R :exports none :results silent :tangle "do_sorting.R"
evtsE.pc <- prcomp(t(evtsE[,goodEvts]))
#+end_src

#+NAME: variance-comparison
#+begin_src R :exports none :results output :tangle "do_sorting.R"
sapply(1:15, function(n) sum(diag(cov(t(noiseE))))+sum(evtsE.pc$sdev[1:n]^2)-sum(evtsE.pc$sdev^2))
#+end_src

#+RESULTS: variance-comparison
:  [1] -277,4651543 -187,5634116 -128,0390777  -91,3186691  -58,8398876
:  [6]  -36,3630674  -21,5437224   -8,2644952    0,2848893    6,9067336
: [11]   13,3415488   19,4720891   25,2553356   29,1021047   32,5634359

#+NAME: cluster-with-k-means
#+begin_src R :exports none :results silent :tangle "do_sorting.R"
set.seed(20061001,kind="Mersenne-Twister")
km10 <- kmeans(evtsE.pc$x[,1:3],centers=10,iter.max=100,nstart=100)
c10 <- km10$cluster
#+end_src

#+NAME: order-clusters
#+begin_src R :exports none :results silent :tangle "do_sorting.R"
cluster.med <- sapply(1:10, function(cIdx) median(evtsE[,goodEvts][,c10==cIdx]))
sizeC <- sapply(1:10,function(cIdx) sum(abs(cluster.med[,cIdx])))
newOrder <- sort.int(sizeC,decreasing=TRUE,index.return=TRUE)$ix
cluster.mad <- sapply(1:10, function(cIdx) {ce <- t(evtsE)[goodEvts,];ce <- ce[c10==cIdx,];apply(ce,2,mad)})
cluster.med <- cluster.med[,newOrder]
cluster.mad <- cluster.mad[,newOrder]
c10b <- sapply(1:10, function(idx) (1:10)[newOrder==idx])[c10]
#+end_src 

#+BEGIN_SRC R :results silent :exports none :tangle "do_sorting.R"
evtsE_noj = lapply(1:10, function(i) mk_aligned_events(sp0E[goodEvts][c10b==i],lD))
#+END_SRC

#+BEGIN_SRC R :exports none :results output :tangle "do_sorting.R"
t(sapply(evtsE_noj, function(l) summary(attr(l,"delta"),digits=3)))
#+END_SRC

#+RESULTS:
#+begin_example
        Min. 1st Qu.   Median     Mean 3rd Qu.  Max.
 [1,] -0,493  -0,253  0,02120 -0,01690   0,171 0,465
 [2,] -0,534  -0,225 -0,03800  0,00695   0,286 0,509
 [3,] -0,450  -0,271  0,02930  0,01750   0,270 0,496
 [4,] -0,475  -0,193  0,01990  0,01360   0,227 0,468
 [5,] -0,627  -0,320  0,04860 -0,05690   0,216 0,337
 [6,] -0,530  -0,235  0,01760  0,01860   0,320 0,473
 [7,] -0,513  -0,249 -0,00277 -0,01360   0,234 0,560
 [8,] -0,514  -0,233  0,00456  0,00753   0,256 0,613
 [9,] -0,574  -0,258  0,02530  0,08350   0,256 4,570
[10,] -0,955  -0,275  0,01010 -0,00546   0,255 2,960
#+end_example

#+BEGIN_SRC R :results silent :exports none :tangle "do_sorting.R"
centers = lapply(1:10, function(i) mk_center_list(attr(evtsE_noj[[i]],"positions"),lD))
names(centers) = paste("Cluster",1:10)
#+END_SRC

#+BEGIN_SRC R :results output :exports none :tangle "do_sorting.R"
round0 = lapply(as.vector(sp0),classify_and_align_evt, data=lD,centers=centers)
sum(sapply(round0, function(l) l[[1]] == '?'))
#+END_SRC 

#+RESULTS:
: [1] 28

#+BEGIN_SRC R :results output :exports none :tangle "do_sorting.R"
pred0 = predict_data(round0,centers)
lD1 = lD - pred0
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :results output :exports none :tangle "do_sorting.R"
lDf <- filter(lD1,rep(1,3)/3)
lDf[is.na(lDf)] <- 0
lDf.mad <- apply(lDf,2,mad)
lDf <- t(t(lDf)/lDf.mad)
bellow.thrs <- t(t(lDf) < thrs)
lDfr <- lDf
lDfr[bellow.thrs] <- 0
remove(lDf)
(sp1 <- peaks(lDfr[,1],15))
#+END_SRC

#+RESULTS:
: 
: eventsPos object with indexes of 247 events. 
:   Mean inter event interval: 1208,87 sampling points, corresponding SD: 1386,01 sampling points 
:   Smallest and largest inter event intervals: 18 and 9140 sampling points.

#+BEGIN_SRC R :results output :exports none :tangle "do_sorting.R"
round1 = lapply(as.vector(sp1),classify_and_align_evt, data=lD1,centers=centers)
sum(sapply(round1, function(l) l[[1]] == '?'))
#+END_SRC 

#+RESULTS:
: [1] 60

#+BEGIN_SRC R :results output :exports none :tangle "do_sorting.R"
pred1 = predict_data(round1,centers)
lD2 = lD1 - pred1
lDf <- filter(lD2,rep(1,3)/3)
lDf[is.na(lDf)] <- 0
lDf.mad <- apply(lDf,2,mad)
lDf <- t(t(lDf)/lDf.mad)
bellow.thrs <- t(t(lDf) < thrs)
lDfr <- lDf
lDfr[bellow.thrs] <- 0
remove(lDf)
(sp2 <- peaks(lDfr[,2],15))
#+END_SRC

#+RESULTS:
: 
: eventsPos object with indexes of 124 events. 
:   Mean inter event interval: 2404,16 sampling points, corresponding SD: 2381,06 sampling points 
:   Smallest and largest inter event intervals: 16 and 10567 sampling points.

#+BEGIN_SRC R :results output :exports none :tangle "do_sorting.R"
round2 = lapply(as.vector(sp2),classify_and_align_evt, data=lD2,centers=centers)
sum(sapply(round2, function(l) l[[1]] == '?'))
#+END_SRC 

#+RESULTS:
: [1] 22

#+BEGIN_SRC R :results output :exports none :tangle "do_sorting.R"
pred2 = predict_data(round2,centers)
lD3 = lD2 - pred2
lDf <- filter(lD3,rep(1,3)/3)
lDf[is.na(lDf)] <- 0
lDf.mad <- apply(lDf,2,mad)
lDf <- t(t(lDf)/lDf.mad)
bellow.thrs <- t(t(lDf) < thrs)
lDfr <- lDf
lDfr[bellow.thrs] <- 0
remove(lDf)
(sp3 <- peaks(lDfr[,3],15))
#+END_SRC

#+RESULTS:
: 
: eventsPos object with indexes of 99 events. 
:   Mean inter event interval: 2993,43 sampling points, corresponding SD: 3686,95 sampling points 
:   Smallest and largest inter event intervals: 34 and 21217 sampling points.

#+BEGIN_SRC R :results output :exports none :tangle "do_sorting.R"
round3 = lapply(as.vector(sp3),classify_and_align_evt, data=lD3,centers=centers)
sum(sapply(round3, function(l) l[[1]] == '?'))
#+END_SRC 

#+RESULTS:
: [1] 21

#+BEGIN_SRC R :results output :exports none :tangle "do_sorting.R"
pred3 = predict_data(round3,centers)
lD4 = lD3 - pred3
lDf <- filter(lD4,rep(1,3)/3)
lDf[is.na(lDf)] <- 0
lDf.mad <- apply(lDf,2,mad)
lDf <- t(t(lDf)/lDf.mad)
bellow.thrs <- t(t(lDf) < thrs)
lDfr <- lDf
lDfr[bellow.thrs] <- 0
remove(lDf)
(sp4 <- peaks(lDfr[,4],15))
#+END_SRC

#+RESULTS:
: 
: eventsPos object with indexes of 164 events. 
:   Mean inter event interval: 1806,91 sampling points, corresponding SD: 1902,64 sampling points 
:   Smallest and largest inter event intervals: 25 and 9089 sampling points.

#+BEGIN_SRC R :results output :expors none :tangle "do_sorting.R"
round4 = lapply(as.vector(sp4),classify_and_align_evt, data=lD4,centers=centers)
sum(sapply(round4, function(l) l[[1]] == '?'))
#+END_SRC 

#+RESULTS:
: [1] 60

#+BEGIN_SRC R :results output :exports none :tangle "do_sorting.R"
pred4 = predict_data(round4,centers)
lD5 = lD4 - pred4
lDf <- filter(lD5,rep(1,3)/3)
lDf[is.na(lDf)] <- 0
lDf.mad <- apply(lDf,2,mad)
lDf <- t(t(lDf)/lDf.mad)
bellow.thrs <- t(t(lDf) < thrs)
lDfr <- lDf
lDfr[bellow.thrs] <- 0
remove(lDf)
(sp5 <- peaks(apply(lDfr,1,sum),15))
#+END_SRC

#+RESULTS:
: 
: eventsPos object with indexes of 234 events. 
:   Mean inter event interval: 1283,21 sampling points, corresponding SD: 1325,54 sampling points 
:   Smallest and largest inter event intervals: 17 and 8484 sampling points.

#+BEGIN_SRC R :results output :exports none :tangle "do_sorting.R"
round5 = lapply(as.vector(sp5),classify_and_align_evt, data=lD5,centers=centers)
sum(sapply(round5, function(l) l[[1]] == '?'))
#+END_SRC 

#+RESULTS:
: [1] 184

#+BEGIN_SRC R :results output :exports none :tangle "do_sorting.R"
round_all = c(round0,round1,round2,round3,round4,round5)
spike_trains = lapply(paste("Cluster",1:10), function(cn) sapply(round_all[sapply(round_all, function(l) l[[1]]==cn)], function(l) l[[2]]+l[[3]]))
names(spike_trains) = paste("Cluster",1:10)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :exports none :tangle "do_sorting.R" :results silent
save.image(file="LocustAnalysis.RData")
#+END_SRC

